Repository: bob-zebedy/CodexBar
Catalog: CodexBar/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# activity-center.section.recent-completions
source: 最近完成
en: Recent Completions

# activity-center.section.recent-terminations
source: 最近终止
en: Recently Stopped

# activity-center.section.running
source: 运行中
en: Running

# activity-center.section.waiting
source: 等待中
en: Waiting

# activity-center.summary.recent-completions
source: 最近完成 %lld
en: Completed: %lld

# activity-center.summary.recent-terminations
source: 最近终止 %lld
en: Stopped: %lld

# activity-center.summary.running
source: 运行 %lld
en: Running: %lld

# activity-center.summary.waiting
source: 等待 %lld
en: Waiting: %lld

# activity-center.title
source: 任务中心
en: Task Center

# activity.action.assign-subagent
source: 分配子 Agent 任务
en: Assign subagent task

# activity.action.call-tool
source: 调用工具
en: Call tool

# activity.action.close-subagent
source: 关闭子 Agent
en: Close subagent

# activity.action.command
source: 执行命令
en: Run command

# activity.action.coordinate-subagents
source: 协调子 Agent
en: Coordinate subagents

# activity.action.edit-files
source: 修改文件
en: Edit files

# activity.action.generate-image
source: 生成图片
en: Generate image

# activity.action.interrupt-subagent
source: 中断子 Agent 任务
en: Interrupt subagent

# activity.action.message-subagent
source: 发送子 Agent 消息
en: Message subagent

# activity.action.query-subagent
source: 查询子 Agent 状态
en: Check subagent status

# activity.action.resume-subagent
source: 恢复子 Agent 会话
en: Resume subagent

# activity.action.search-web
source: 搜索网页
en: Search web

# activity.action.start-subagent
source: 启动子 Agent
en: Start subagent

# activity.action.view-image
source: 查看图片
en: View image

# activity.action.wait-subagent
source: 等待子 Agent 结果
en: Await subagent results

# activity.action.wait-timer
source: 等待计时结束
en: Wait for timer

# activity.anonymous.keep-awake-exclusion
source: 匿名任务不参与防睡眠
en: Anonymous tasks do not prevent sleep

# activity.duration.elapsed
source: 耗时 %@
en: Duration %@

# activity.live.action-completed
source: %@完成
en: %@ completed

# activity.live.action-declined
source: %@被拒绝
en: %@ declined

# activity.live.action-failed
source: %@失败
en: %@ failed

# activity.live.actions-listFiles
source: 浏览目录
en: Browsing

# activity.live.actions-listFiles-search
source: 浏览目录, 搜索内容
en: Browsing, Searching

# activity.live.actions-read
source: 读取文件
en: Reading

# activity.live.actions-read-listFiles
source: 读取文件, 浏览目录
en: Reading, Browsing

# activity.live.actions-read-listFiles-search
source: 读取文件, 浏览目录, 搜索内容
en: Reading, Browsing, Searching

# activity.live.actions-read-search
source: 读取文件, 搜索内容
en: Reading, Searching

# activity.live.actions-search
source: 搜索内容
en: Searching

# activity.live.agent-assigning
source: 正在向子 Agent 分配任务
en: Delegating to subagent

# activity.live.agent-closing
source: 正在关闭子 Agent
en: Closing subagent

# activity.live.agent-completed
source: 子 Agent 任务已完成
en: Subagent done

# activity.live.agent-contacting
source: 正在向子 Agent 发送消息
en: Messaging subagent

# activity.live.agent-coordinating
source: 正在协调子 Agent
en: Coordinating subagents

# activity.live.agent-failed
source: 子 Agent 任务执行失败
en: Subagent failed

# activity.live.agent-interrupted
source: 子 Agent 任务已中断
en: Subagent interrupted

# activity.live.agent-interrupting
source: 正在中断子 Agent 任务
en: Interrupting subagent

# activity.live.agent-querying
source: 正在查询子 Agent 状态
en: Checking subagent status

# activity.live.agent-resuming
source: 正在恢复子 Agent 会话
en: Resuming subagent

# activity.live.agent-started
source: 子 Agent 已启动
en: Subagent started

# activity.live.agent-starting
source: 正在启动子 Agent
en: Starting subagent

# activity.live.agent-waiting
source: 正在等待子 Agent 结果
en: Awaiting subagent results

# activity.live.answering
source: 正在回答
en: Answering

# activity.live.approval-aborted
source: 自动审批已中止
en: Auto-approval aborted

# activity.live.approval-approved
source: 自动审批已通过
en: Auto-approved

# activity.live.approval-denied
source: 自动审批未通过
en: Auto-denied

# activity.live.approval-timeout
source: 自动审批已超时
en: Auto-approval timed out

# activity.live.auth-recovery-ended
source: 认证恢复流程已结束
en: Auth recovery ended

# activity.live.auto-approval
source: 正在自动审批
en: Reviewing

# activity.live.buffering
source: 正在缓冲回复
en: Buffering

# activity.live.calling-named-tool
source: 正在调用 %@
en: Calling %@

# activity.live.calling-tool
source: 正在调用工具
en: Calling tool

# activity.live.command
source: 正在执行命令
en: Running command

# activity.live.command-listFiles
source: 正在浏览目录
en: Browsing

# activity.live.command-listFiles-search
source: 正在浏览目录, 搜索内容
en: Browsing, Searching

# activity.live.command-read
source: 正在读取文件
en: Reading

# activity.live.command-read-listFiles
source: 正在读取文件, 浏览目录
en: Reading, Browsing

# activity.live.command-read-listFiles-search
source: 正在读取文件, 浏览目录, 搜索内容
en: Reading, Browsing, Searching

# activity.live.command-read-search
source: 正在读取文件, 搜索内容
en: Reading, Searching

# activity.live.command-search
source: 正在搜索内容
en: Searching

# activity.live.command-with-actions
source: 正在执行命令 (%@)
en: Running command (%@)

# activity.live.commentary
source: 正在汇报进度
en: Updating

# activity.live.compacting
source: 正在压缩上下文
en: Compacting

# activity.live.compaction-completed
source: 上下文压缩完成
en: Context compacted

# activity.live.connecting
source: 正在连接 Codex 服务
en: Connecting to Codex

# activity.live.connecting-tool
source: 正在启动 MCP 服务
en: Starting MCP

# activity.live.diff-updated
source: 改动详情已更新
en: Diff updated

# activity.live.editing
source: 正在修改文件
en: Editing

# activity.live.elapsed-running
source: 已运行
en: Running for

# activity.live.elapsed-waiting
source: 已等待
en: Waited

# activity.live.environment-connected
source: 已连接执行环境
en: Environment connected

# activity.live.environment-disconnected
source: 已断开执行环境连接
en: Environment disconnected

# activity.live.failed
source: 执行失败
en: Failed

# activity.live.file-completed
source: 文件修改完成
en: File edits applied

# activity.live.file-declined
source: 文件修改被拒绝
en: File edits declined

# activity.live.file-failed
source: 文件修改失败
en: File edits failed

# activity.live.finding-web
source: 正在网页查找内容
en: Finding in page

# activity.live.generating-image
source: 正在生成图片
en: Generating image

# activity.live.hook-blocked
source: 操作被 Hook 拦截
en: Blocked by hook

# activity.live.hook-completed
source: Hook 执行已完成
en: Hook completed

# activity.live.hook-failed
source: Hook 执行已失败
en: Hook failed

# activity.live.hook-stopped
source: Hook 执行已停止
en: Hook stopped

# activity.live.idle
source: 暂无任务
en: No tasks

# activity.live.image-completed
source: 图片生成完成
en: Image generated

# activity.live.image-declined
source: 图片生成被拒绝
en: Image generation declined

# activity.live.image-failed
source: 图片生成失败
en: Image generation failed

# activity.live.interrupted
source: 已中断
en: Interrupted

# activity.live.model-changed
source: 模型已切换
en: Model switched

# activity.live.model-changed-detail
source: 模型已切换 %@
en: Model switched %@

# activity.live.named-tool-completed
source: %@ 执行完成
en: %@ completed

# activity.live.named-tool-declined
source: %@ 调用被拒绝
en: %@ declined

# activity.live.named-tool-failed
source: %@ 执行失败
en: %@ failed

# activity.live.opening-web
source: 正在打开网页
en: Opening page

# activity.live.plan-progress
source: 已完成步骤
en: Steps done

# activity.live.plan-step-completed
source: 计划步骤已完成
en: Plan step done

# activity.live.plan-updated
source: 计划已更新
en: Plan updated

# activity.live.planning
source: 正在制定计划
en: Planning

# activity.live.processing
source: 正在处理任务
en: Processing

# activity.live.recent-event
source: 最近事件
en: Latest event

# activity.live.reconnecting
source: 正在重新连接 Codex 服务
en: Reconnecting to Codex

# activity.live.recovering-auth
source: 正在恢复认证
en: Recovering auth

# activity.live.recovering-state
source: 正在同步任务状态
en: Syncing task state

# activity.live.replying
source: 正在回复
en: Replying

# activity.live.request-ended
source: 用户操作请求已结束
en: Request ended

# activity.live.retrying
source: 正在重试
en: Retrying

# activity.live.review-mode
source: 代码审查模式
en: Code review

# activity.live.running
source: 运行中
en: Running

# activity.live.running-hook
source: 正在执行 Hook
en: Running hook

# activity.live.searching-web
source: 正在搜索网页
en: Searching web

# activity.live.sleeping
source: 正在等待计时结束
en: Waiting for timer

# activity.live.subagent-count
source: %lld 个子 Agent 运行中
en: %lld subagents running

# activity.live.thinking
source: 正在思考
en: Thinking

# activity.live.tool-completed
source: 工具执行完成
en: Tool call done

# activity.live.tool-count
source: %lld 个工具正在调用
en: %lld active tool calls

# activity.live.tool-declined
source: 工具调用被拒绝
en: Tool call declined

# activity.live.tool-failed
source: 工具执行失败
en: Tool call failed

# activity.live.unavailable
source: 暂时无法获取任务状态
en: Task status unavailable

# activity.live.using-web
source: 正在使用网页工具
en: Using web tool

# activity.live.verification-needed
source: 需要完成验证
en: Verification required

# activity.live.viewing-image
source: 正在查看图片
en: Viewing image

# activity.live.waiting-approval
source: 等待用户审批
en: Awaiting approval

# activity.live.waiting-external
source: 等待外部操作
en: Awaiting external action

# activity.live.waiting-form
source: 等待提供信息
en: Awaiting info

# activity.live.waiting-input
source: 等待用户输入
en: Awaiting input

# activity.live.waiting-service
source: 等待回应服务请求
en: Awaiting response

# activity.live.waiting-user
source: 等待用户操作
en: Awaiting user action

# activity.live.waiting-verification
source: 等待用户验证
en: Awaiting verification

# activity.relative.completed-minutes-ago
source: %lld 分钟前完成
en: Completed %lld min ago

# activity.relative.completed-seconds-ago
source: %lld 秒前完成
en: Completed %lld sec ago

# activity.relative.just-completed
source: 刚刚完成
en: Just completed

# activity.relative.just-stopped
source: 刚刚终止
en: Just stopped

# activity.relative.stopped-minutes-ago
source: %lld 分钟前终止
en: Stopped %lld min ago

# activity.relative.stopped-seconds-ago
source: %lld 秒前终止
en: Stopped %lld sec ago

# activity.summary.other-task-count
source: 另有 %lld 个任务
en: Other tasks: %lld

# app.action.quit
source: 退出 CodexBar
en: Quit CodexBar

# app.command.settings
source: 设置…
en: Settings…

# app.menu.log
source: 日志
en: Log

# app.menu.settings
source: 设置
en: Settings

# auto-reset.confirmation.message
source: 开启后, CodexBar 在手动重置临近过期时, 按设置的临期时间提前自动使用重置; 并可能短暂唤醒 Mac
en: When enabled, CodexBar automatically uses a manual reset credit at the configured time before it expires and may briefly wake your Mac.

# auto-reset.confirmation.title
source: 开启自动重置?
en: Enable Automatic Reset?

# auto-reset.error.wake-schedule-failed
source: 设置自动重置唤醒计划失败
en: Could not schedule a wake event for Automatic Reset

# auto-reset.lead-time.fifteen-minutes
source: 15 分钟
en: 15 Minutes

# auto-reset.lead-time.four-hours
source: 4 小时
en: 4 Hours

# auto-reset.lead-time.one-hour
source: 1 小时
en: 1 Hour

# auto-reset.lead-time.six-hours
source: 6 小时
en: 6 Hours

# auto-reset.lead-time.thirty-minutes
source: 30 分钟
en: 30 Minutes

# auto-reset.lead-time.title
source: 临期时间
en: Time Before Expiration

# auto-reset.lead-time.two-hours
source: 2 小时
en: 2 Hours

# banked-reset.available-count
source: 可用: %lld
en: %lld left

# banked-reset.count
source: 留存重置: %lld
en: Banked Resets: %lld

# banked-reset.expiration.label
source: 过期时间
en: Expires

# banked-reset.expiration.unknown
source: 未知过期时间
en: Expiration time unknown

# codex-status.account.error.not-logged-in
source: Codex 未登录
en: Codex is not signed in

# codex-status.account.not-signed-in
source: 未登录
en: Not signed in

# codex-status.app-server.error.connection-closed
source: Codex app-server 连接已经断开
en: The Codex app-server connection closed

# codex-status.app-server.error.invalid-response
source: Codex app-server 响应无法解析
en: Could not parse the Codex app-server response

# codex-status.app-server.error.server-timeout
source: Codex app-server 等待响应超时
en: Timed out waiting for a Codex app-server response

# codex-status.app-server.error.unsupported-method
source: Codex app-server 不支持该接口
en: The Codex app-server does not support this method

# codex-status.daemon.error.unavailable
source: Codex 后台服务不可用
en: Codex Daemon is unavailable

# codex-tui-notifications.error.read-failed
source: 读取 Codex TUI 通知设置失败
en: Could not read Codex TUI notification settings

# codex-tui-notifications.error.state-mismatch
source: Codex TUI 通知状态与设置不一致
en: Codex TUI notification status does not match the setting

# codex-tui-notifications.error.write-failed
source: 写入 Codex TUI 通知设置失败
en: Could not update Codex TUI notification settings

# codex-version.requirement
source: 需要 Codex %@ 或更高版本
en: Codex %@ or later is required

# codex.daemon.command-failed
source: Codex 后台服务启动失败: %d
en: Failed to start Codex Daemon: %d

# codex.daemon.not-installed
source: 未找到可用的 Codex
en: No usable Codex installation found

# codex.daemon.not-ready
source: Codex 后台服务无法连接
en: Cannot connect to Codex Daemon

# codex.daemon.timeout
source: Codex 后台服务启动超时
en: Codex Daemon startup timed out

# codex.daemon.unsupported-command
source: Codex 不支持后台服务
en: Codex Daemon is not supported

# codex.version.launch-failed
source: 启动失败
en: Failed to launch

# codex.version.parse-failed
source: 版本未知
en: Version not recognized

# codex.version.read-failed
source: 读取失败
en: Failed to read version

# codex.version.read-timeout
source: 读取超时
en: Version check timed out

# codex.version.unknown
source: 未知版本
en: Unknown version

# common.action.cancel
source: 取消
en: Cancel

# common.action.clear
source: 清空
en: Clear

# common.action.click-to-copy
source: 点击复制
en: Click to Copy

# common.action.close
source: 关闭
en: Close

# common.action.copy
source: 复制
en: Copy

# common.action.enable
source: 开启
en: Enable

# common.action.open-system-settings
source: 打开系统设置
en: Open System Settings

# common.action.preview
source: 预览
en: Preview

# common.action.quit
source: 退出
en: Quit

# common.action.restore-default
source: 恢复默认
en: Restore Default

# common.empty.no-data
source: 暂无数据
en: No data

# common.status.available
source: 可用
en: Available

# common.status.copied
source: 已复制
en: Copied

# common.status.not-set
source: 未设置
en: Not set

# date-picker.next-month
source: 下个月
en: Next Month

# date-picker.previous-month
source: 上个月
en: Previous Month

# date-picker.select-end
source: 选择结束日期
en: Select an end date

# date-picker.select-range
source: 选择日期范围
en: Select Date Range

# date-picker.select-start
source: 选择开始日期
en: Select a start date

# duration.days-compact
source: %lld天
en: %lldd

# duration.minutes
source: %lld 分钟
en: %lld min

# duration.seconds
source: %lld 秒
en: %lld sec

# helper.error.assets-invalid
source: CodexBar Helper 组件或配置异常, 请重新安装 CodexBar
en: Helper validation failed. Reinstall CodexBar

# helper.error.assets-missing
source: CodexBar Helper 组件或配置丢失, 请重新安装 CodexBar
en: Helper incomplete. Reinstall CodexBar

# helper.error.connection-failed
source: 连接服务失败
en: Could not connect to the service

# helper.error.connection-interrupted
source: 服务连接中断
en: The service connection was interrupted

# helper.error.invalid-interface
source: 服务接口无效
en: Invalid service interface

# helper.error.no-response
source: 服务无响应
en: The service is not responding

# helper.error.registration-failed
source: 注册服务失败
en: Could not register the service

# helper.error.update-failed
source: 更新服务失败
en: Could not update the service

# helper.status.authorization-required
source: 需要授权允许 CodexBar 后台运行
en: Allow CodexBar to run in the background

# helper.status.install-and-authorize
source: 需要安装并授权 CodexBar Helper 后台运行
en: Install CodexBar Helper and allow background activity

# helper.status.installed-needs-authorization
source: 已安装 CodexBar Helper 但需要授权允许后台运行
en: CodexBar Helper installed. Allow background activity

# helper.status.not-registered
source: CodexBarHelper 尚未注册
en: CodexBarHelper is not registered

# history.metric.approvals
source: 权限请求
en: Approvals

# history.metric.compactions
source: 上下文压缩
en: Compactions

# history.metric.sessions
source: 会话总数
en: Sessions

# history.metric.subagents
source: 子智能体
en: Subagents

# history.metric.tool-calls
source: 工具调用
en: Tool Calls

# history.metric.turns
source: 对话轮次
en: Turns

# history.rebuild.action
source: 重建
en: Rebuild

# history.rebuild.confirmation.message
source: 将从本地采集的 app-server 事件重新统计 %@ 的活动数据和会话数据 同步后将替换本机数据并更新云端数据
en: Recalculate activity data and session data for %@ from locally collected app-server events After syncing, local data will be replaced and cloud data updated

# history.rebuild.confirmation.title
source: 批量重建 %lld 天的数据?
en: Rebuild selected dates (%lld)?

# history.rebuild.error.incomplete-source
source: 原始事件包含无法读取的记录, 请修复后重试
en: The original event data contains unreadable records. Please fix them and retry.

# history.rebuild.error.source-changed
source: 本地数据发生变化, 请重试
en: Local data changed; try again

# history.rebuild.error.source-unavailable
source: 没有可重建的本地数据
en: No local data is available to rebuild

# history.rebuild.result.completed
source: 重建完成
en: Rebuild Complete

# history.rebuild.result.failed
source: 重建失败
en: Rebuild Failed

# history.rebuild.summary.additional-dates
source: 等
en: , etc

# history.rebuild.summary.cloud-replacement-pending
source: ; 云端替换将在同步可用后继续
en: ; cloud data will be replaced when sync becomes available

# history.rebuild.summary.completed
source: 已重建 %1$lld 天, 活动事件 %2$lld 条
en: Days rebuilt: %1$lld; events: %2$lld

# history.rebuild.summary.incomplete-dates
source: ; %1$lld 天未完成 (%2$@)
en: ; dates not rebuilt (%1$lld): %2$@

# history.rebuild.summary.request-failed
source: ; 部分重建未能开始, 请重新尝试
en: ; rebuild could not start, please retry

# history.rebuild.summary.retry-later
source: , 稍后会自动重试
en: , will retry automatically

# history.rebuild.summary.token-history-incomplete
source: ; 会话数据未完成重建, 请重试
en: ; session data rebuild incomplete, please retry

# history.rebuild.summary.token-record-count
source: ; 会话数据 %lld 条
en: ; %lld session data records

# history.rebuild.title
source: 重建数据
en: Rebuild Data

# hotkey.error.default-in-use
source: 默认快捷键 %@ 已被占用
en: Default shortcut %@ is already in use

# hotkey.error.in-use
source: 快捷键已被占用
en: Shortcut is already in use

# hotkey.error.unrecognized
source: 无法识别该快捷键
en: Shortcut not recognized

# hotkey.validation.minimum-modifiers
source: 至少需要两个修饰键
en: Use at least two modifier keys

# hotkey.validation.system-reserved
source: 不可使用系统快捷键
en: This shortcut is reserved by the system

# keep-alive.confirmation.message
source: 开启后, CodexBar 会在 Codex 任务运行时防止系统睡眠, 任务结束后自动恢复
en: When enabled, CodexBar prevents system sleep while Codex tasks are running and restores normal sleep afterward.

# keep-alive.confirmation.title
source: 开启防止睡眠?
en: Enable System Sleep Prevention?

# keep-alive.display.caption
source: 同时阻止屏幕保护与自动锁屏
en: Also prevent the screen saver and auto-lock

# keep-alive.display.title
source: 保持屏幕常亮
en: Keep Display Awake

# keep-alive.duration-limit.caption
source: 防睡眠时长超过阈值后自动恢复系统睡眠
en: Restore normal sleep when the limit is reached

# keep-alive.duration-limit.title
source: 最长防睡眠时间
en: Keep-Awake Limit

# keep-alive.duration.hours
source: %lld 小时
en: %lld hr

# keep-alive.duration.unlimited
source: 无限制
en: Unlimited

# keep-alive.error.prevent-idle-sleep-failed
source: 防止空闲睡眠失败
en: Could not prevent idle sleep

# keep-alive.error.restore-idle-sleep-failed
source: 恢复空闲睡眠策略失败
en: Could not restore the idle sleep policy

# keep-alive.error.retry-limit-reached
source: 防睡眠多次失败, 已停止重试
en: Keep-awake failed repeatedly; retries stopped

# keep-alive.error.toggle-sleep-failed
source: 切换睡眠状态失败
en: Could not change the system sleep state

# keep-alive.low-battery.caption
source: 仅在使用电池供电时生效, 充电时自动恢复
en: Battery only; resumes when charging

# keep-alive.low-battery.off
source: 关闭
en: Off

# keep-alive.low-battery.title
source: 低电量保护
en: Low Battery Protection

# keep-alive.status.disabled-by-other-source
source: 系统睡眠已由其他来源关闭
en: System sleep is disabled by another source

# keep-alive.status.duration-limit-reached
source: 已达到防睡眠时间上限 (%@)
en: Keep-awake limit reached (%@)

# keep-alive.status.low-battery
source: 电量过低, 已恢复系统睡眠
en: Low battery; system sleep restored

# keep-alive.waiting.caption
source: 任务等待批准期间继续防止系统睡眠
en: Prevent sleep while a task awaits approval

# keep-alive.waiting.title
source: 等待批准时保持防睡眠
en: Keep Awake While Waiting

# log.app-server.error.initialization-failed
source: app-server 会话初始化失败: %@
en: Failed to initialize the app-server session: %@

# log.app-server.window.title
source: Codex app-server 日志
en: Codex app-server Log

# log.empty.no-entries
source: 暂无日志
en: No log entries

# log.label.connection-event
source: 连接
en: Connection

# log.label.error
source: 错误
en: Error

# log.label.local
source: 本地
en: Local

# log.label.received
source: 接收
en: Received

# log.label.sent
source: 发送
en: Sent

# log.payload.details
source: 详情
en: Details

# log.payload.received
source: 接收内容
en: Received Content

# log.payload.request
source: 请求
en: Request

# log.payload.response
source: 响应
en: Response

# log.persistence.error.read
source: 无法读取已保存的日志
en: Could not read the saved logs

# log.persistence.error.write
source: 无法保存日志
en: Could not save the logs

# log.persistence.interrupted
source: 上次运行结束时尚未收到响应
en: The previous run ended before a response was received

# log.status.waiting-response
source: 等待响应
en: Waiting for response

# log.window.title
source: CodexBar 日志
en: CodexBar Log

# menu-bar-quota.selection.off
source: 关闭
en: Off

# menu-bar-quota.selection.primary
source: 主额度
en: Primary

# menu-bar-quota.selection.secondary
source: 次额度
en: Secondary

# notification.auto-reset-failed.body.authentication
source: Codex 登录状态已失效
en: Codex sign-in has expired

# notification.auto-reset-failed.body.expired
source: 重置已过期, 自动重置未完成
en: Expired before Automatic Reset could complete

# notification.auto-reset-failed.body.permanent
source: 请求无法完成
en: The request could not be completed

# notification.auto-reset-failed.title
source: 自动重置失败
en: Automatic Reset Failed

# notification.auto-reset.body.count
source: 剩余重置次数: %lld
en: Reset credits remaining: %lld

# notification.auto-reset.title
source: 自动重置
en: Automatic Reset

# notification.banked-reset-expiry.body
source: 有 %1$lld 个重置次数将于 %2$@ 过期
en: Reset credits expiring on %2$@: %1$lld

# notification.banked-reset-expiry.title
source: 重置即将过期
en: Banked Resets Expiring Soon

# notification.keep-alive-ended.duration-limit
source: 已达防睡眠上限 %@, 已停止防睡眠
en: Keep-awake stopped after %@

# notification.keep-alive-ended.low-battery
source: 电量剩余 %@, 已停止防睡眠
en: Battery at %@; keep-awake stopped

# notification.keep-alive-ended.title
source: 已恢复系统睡眠
en: System Sleep Restored

# notification.low-quota.body
source: %1$@ %2$@ 剩余额度已低于 %3$@
en: %1$@ %2$@: less than %3$@ remaining

# notification.low-quota.title
source: Codex 额度不足
en: Codex Quota Is Low

# notification.protection.body.codex
source: Codex 任务已静默 %@, 已隐藏并停止参与防睡眠
en: No progress on the Codex task for %@; hidden and excluded from keep-awake

# notification.protection.body.project
source: %1$@ 已静默 %2$@, 已隐藏并停止参与防睡眠
en: No progress in "%1$@" for %2$@; hidden and excluded from keep-awake

# notification.protection.title
source: Codex 任务长时间无进展
en: Codex Task Stalled

# notification.quota-reset.title
source: 额度已重置
en: Quota Reset

# notification.sound.default
source: 默认
en: Default

# notification.sound.silent
source: 静音
en: None

# notification.task-completed.body.codex
source: Codex 任务完成, %@
en: Codex task completed • %@

# notification.task-completed.body.project
source: 「%1$@」任务完成, %2$@
en: Task completed in "%1$@" • %2$@

# notification.task-completed.title
source: Codex 任务完成
en: Codex Task Completed

# notification.task-waiting.body.codex
source: Codex 正在等待批准下一步操作
en: Codex is waiting for approval to continue

# notification.task-waiting.body.codex-tool
source: Codex 等待批准 %@
en: Codex needs approval %@

# notification.task-waiting.body.project
source: 「%@」正在等待批准下一步操作
en: A task in "%@" is waiting for approval to continue
